Пример проекта, в котором есть перехватчик запросов для последующей подмены также имеется сервер для моков.

SimpleResponseInterceptor implements Interceptor и в нем мы переопределяем метод intercept, чтобы отправлять ответ
с нужными нам данными.
Например, в тесте testReplaceResponseGet() мы создаем экземпляр класса SimpleResponseInterceptor с нужными для нас параметрами ответа и
добавляем прехватчик в клиент. После того, как мы отправим запрос мы получим ответ с настройками указанными в экземпляре.

SimpleDispatcher extends Dispatcher и в нем мы переопределяем метод dispatch, чтобы отправлять нужный нам ответ с мок-сервера.
Например, в тесте testMockResponseGet мы подставляем "http://127.0.0.2:8088/get" для отправки реквеста, а уже потом, после отправки, мок-сервер
сравнивает url запроса и отправляет соответствующий ответ, который был определен в методе dispatch.